# Написать функцию host_range_ping_tab(), возможности которой основаны на функции из примера 2.
# Но в данном случае результат должен быть итоговым по всем ip-адресам, представленным в табличном формате
# (использовать модуль tabulate). Таблица должна состоять из двух колонок и выглядеть примерно так:
# Reachable
# 10.0.0.1
# 10.0.0.2
#
# Unreachable
# 10.0.0.3
# 10.0.0.4

from tabulate import tabulate

from Task2 import checked_ip


def host_range_ping_tab(ip_dict):
    print(tabulate(ip_dict, headers='keys', tablefmt="grid"))


if __name__ == '__main__':
    host_range_ping_tab(checked_ip)

# +----------------+-------------+  # (Введенное число последующих ip-адресов для проверки доступности: 3)
# | reached        | reachless   |
# +================+=============+
# | 192.168.0.2    | 80.0.1.2    |
# +----------------+-------------+
# | 192.168.0.3    | 77.88.55.78 |
# +----------------+-------------+
# | 192.168.0.4    | 77.88.55.79 |
# +----------------+-------------+
# | 80.0.1.3       |             |
# +----------------+-------------+
# | 80.0.1.4       |             |
# +----------------+-------------+
# | 77.88.55.80    |             |
# +----------------+-------------+
# | 217.69.139.201 |             |
# +----------------+-------------+
# | 217.69.139.202 |             |
# +----------------+-------------+
# | 217.69.139.203 |             |
# +----------------+-------------+
